<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.7 [en] (X11; I; OSF1 V4.0 alpha) [Netscape]">
   <meta name="ProgId" content="FrontPage.Editor.Document">
   <title>Control System Design - Preface</title>
   <base target="main">
<link rel="stylesheet" href="style.css" type="text/css">
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#993300" vlink="#660000" alink="#FF0000" topmargin="3" leftmargin="3">
&nbsp;
<center><table BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH="600" >
<tr>
<td>You are here : <a href="index.html" target="_top">Control System Design
- Index</a> | <a href="book.html">Book Contents</a> | Preface (German)
<center>
<h2>
Vorwort</h2></center>
Regelungstechnik ist von h&ouml;chster Bedeutung f&uuml;r moderne technische
Systeme. Die Vorteile verbesserter Regelungen sind in vielen Industrien
bedeutend, in manchen entscheidend: H&ouml;here Produktqualit&auml;t, reduzierter
Energieverbrauch, Verringerung von Abfall- und Nebenprodukten, weniger
Emissionen und gr&ouml;&szlig;ere Sicherheit.
<p>Eine Schwierigkeit liegt allerdings darin, da&szlig; viele der Methoden
und Ergebnisse der Regelungstechnik ein fundiertes Wissen fortgeschrittener
Mathematik voraussetzen. Die Entwicklung einer mathematischen Systemtheorie
geh&ouml;rt sicherlich zu den gro&szlig;en Errungenschaften der Wissenschaften
im 20. Jahrhundert. Ihre industrielle Bedeutung wird aber entscheidend
von der Gr&ouml;&szlig;e der wirtschaftlichen Vorteile bestimmt, die sich
durch ihre praktische Umsetzung ableiten lassen. Mit diesem Buch versuchen
wir, ein ausgewogenes Verst&auml;ndnis von Analyse, Synthese, Design und
Zielkonflikten zu vermitteln, welches eine grundlegende Voraussetzung f&uuml;r
die erfolgreiche Anwendung regelungstechnischen Wissens ist.
<p>Ein Gro&szlig;teil unserer Inspiration, dieses Buch zu schreiben, kommt
aus den Erfahrungen der industriellen Projekte, die die Autoren durchgef&uuml;hrt
haben. In einem typischen Projekt fanden wir uns bald in hydro- oder thermodynamischen
Untersuchungen verwickelt, erlebten die negativen Auswirkungen nicht-konstanter
SPS-Abtastzeiten, setzten uns mit Systemintegration und Netzwerkprotokollen
auseinander, bauten Vertrauen zum Schichtpersonal und &uuml;berdachten
Methoden, wie man vorl&auml;ufige Reglerkandidaten auf gef&auml;hrlichen
Anlagen sicher testen kann. Kurz, wir erlebten die t&auml;gliche Spannung,
Frustration, R&uuml;ckschl&auml;ge und Erfolge, die bei dem kommerziellem
Einsatz von Advanced Control entstehen. Es ist keine einfache Aufgabe und
sie stellt zahlreiche interdisziplin&auml;re Anforderungen. Aber es ist
eine befriedigende und spannende Arbeit, welches wir auch mit diesem Buch
zu vermitteln hoffen.
<p>Das Buch ist auch als ein Beitrag zur kontinuierlichen Weiterentwicklung
des regeltechnischen Lehrplans gedacht, einem Thema, dem besonders in letzter
Zeit viel internationale Aufmerksamkeit gewidmet wird. So ist zum Beispiel
eine 'Special Section' zur Erneuerung des Lehrplans k&uuml;rzlich im IEEE
Control Systems Magazine erschienen.
<p>Selbstverst&auml;ndlich wird ein Lehrplan nicht nur durch B&uuml;cher
erneuert - es geschieht vor allem durch die beteiligten Menschen: Studenten,
Professoren, Forscher, industrielle Anwender und Reviewers. Es wird auch
gemeinsam vieler neu-&uuml;berdachter B&uuml;cher, Labor&uuml;bungen, Simulationen
und webbasierender Methoden bed&uuml;rfen, die von verschiedenen oder sich
gegenseitig komplementierenden Ans&auml;tzen ausgehen. Wir hoffen, da&szlig;
auch das vorliegende Buch einen Beitrag dazu leisten kann, den regelungstechnischen
Lehrplan zu revitalisieren und das Interesse an diesem &uuml;beraus wichtigen
und spannenden Fachbereich zu erhalten und verst&auml;rken.
<p>Wir betonen allerdings auch, da&szlig; dieses kein rezeptartiges 'How-To'
Buch ist. Es ist eine umfassende, h&auml;ufig komprimierte Darlegung der
rigorosen Regelungstechnik. Durchaus benutzen wir zu diesem Zweck mathematische
Methoden, um den zu regelnden Prozess zu modelieren,
<br>seine Eigenschaften bei R&uuml;ckopplung zu analysieren, einen Regler
mit gew&uuml;nschten Eigenschaften zu
<br>synthetisieren und um dann schlie&szlig;lich zu einem Design zu gelangen,
das die Begrenzungen und Zielkonflikte des konkreten Falles ber&uuml;cksichtigt.
<p>Wir sind davon &uuml;berzeugt, da&szlig; erfolgreiche Proze&szlig;regelung
auf der kreativen Vereinigung zweier
<br>fundamentaler Voraussetzungen beruht. Erstens, ein gutes Verst&auml;ndnis
des zu regelnden Prozesses und der daf&uuml;r relevanten physikalischen,
chemischen und anderen Prinzipien; und zweitens, ein solides Wissen fundamentaler
Eigenschaften von Signalen, Systemen und R&uuml;ckkopplung. Typischerweise
betr&auml;gt der Beitrag des Ersteren circa 50% des Gesamtaufwandes. Es
ist allerdings unm&ouml;glich, jeden denkbaren Proze&szlig; in einem regelungstechnischen
Buch zu beschreiben; schlie&szlig;lich
<br>w&uuml;rde dieses u.a. alle Prozesse der chemischen Industrien, der
Luftfahrt, der Robotik, des
<br>Energiesektors sowie der medizinisch-technischen Anwendungen umfassen.
Daher konzentriert sich das Buch notwendigerweise auf den zweiten Aspekt,
n&auml;mlich auf die fundamentalen Prinzipien der
<br>Regelungstechnik, die allen Anwendungen zugrundeliegen. Unsere Bem&uuml;hungen
liegen vor allem darin, das abstrahierte Wissen so darzustellen, da&szlig;
es vom Leser m&ouml;glichst effizient auf konkrete
<br>Anwendungen umgesetzt werden kann. Zus&auml;tzlich enth&auml;lt das
Buch zahlreiche industrielle
<br>Fallbeispiele, die die konkrete Umsetzung illustrieren.
<p>In erster Linie besch&auml;ftigt sich das Buch mit zeitkontinuierlicher
Regelungstechnik. Aber auch
<br>digitale Regelungstechnik wird mit hinreichender Tiefe behandelt, um
Computerimplementierungen
<br>vornehmen zu k&ouml;nnen. Das Endergebnis ist ein Buch, das einen gr&ouml;&szlig;eren
Umfang als urspr&uuml;nglich
<br>geplant war, hat; es besitzt daf&uuml;r aber den Vorteil der umfassenden
Themenwahl. Nat&uuml;rlich gibt es
<br>auch Themen, die nicht behandelt werden. Wir sind aber zuversichtlich,
da&szlig; das Buch dem interessierten Leser ausreichend solide Grundlagen
zum weiteren Studium zus&auml;tzlicher Litteratur bietet.
<p>Betreffend Stil und Inhalt haben wir folgende Ziele verfolgt:
<ul>
<li>
eine zug&auml;ngliche Darstellung rigorosen Materials, das f&uuml;r Anwendungen
relevant ist;</li>

<li>
fr&uuml;hzeitige Hinweise auf Design, d.h., Verst&auml;ndnis f&uuml;r Begrenzungen
und Zielkonflikte wecken;</li>

<li>
zahlreiche industrielle Fallbeispiele;</li>

<li>
zus&auml;tzliche Anschaulichkeit und Motivation durch simulations- und
webbasierte Unterst&uuml;tzung.</li>
</ul>
Unsere Darstellung betont auch den wichtigen Unterschied zwischen Analyse,
Synthese und Design.
<br>Analyse besch&auml;ftigt sich damit, Eigenschaften wie Stabilit&auml;t
oder St&ouml;rempfindlichkeit eines gegebenen Regelkreises zu erheben.
Im Gegensatz dazu ist Synthese von folgender Fragestellung motiviert: Ausgehend
von einem Proze&szlig; und gew&uuml;nschten Eigenschaften des zu erstellenden
Regelkreises, wird derjenige Regler gesucht (falls &uuml;berhaupt existent),
der diese Eigenschaften erreicht. Design besch&auml;ftigt sich mit dem
Umgang mit Zielkonflikten: welche der idealerweise
<br>erw&uuml;nschten Eigenschaften stehen in Konflikt zueinander; wie kann
man die Methoden der
<br>Synthese zum Erreichen von guten Kompromissen nutzen; und wie kann
man die G&uuml;te der
<br>Kompromisse durch Analyse verifizieren. Als Ausgangsbasis w&auml;hlen
wir dabei die
<br>fundamentalen Zielkonflikte, die von jeder Anwendung und L&ouml;sung
honoriert werden m&uuml;ssen, und leiten daraus Analyse- und Synthesemethoden
ab.
<p>Dabei verfolgen wir aber keine komplette Pr&auml;sentation der mathematischen
Systemtheorie,
<br>sondern konzentrieren uns auf diejenigen Schwerpunkte, die dem Leser
m&ouml;glichst rasch
<br>zur L&ouml;sung angewandter Fragen verhelfen. In diesem Sinn gehen
wir auch davon aus, da&szlig; der
<br>Leser Zugang zu modernen Softwarepaketen f&uuml;r numerische Berechnungen
und Simulation hat,
<br>z.B. MATLAB-SIMULINK. Auf Grund dieser Annahme konzentriert sich unsere
Darstellung
<br>auf die prinzipiellen Eigenschaften von L&ouml;sungsmethoden, anstatt
auf die Werkzeuge f&uuml;r deren Berechnung. Jedes Kapitel enth&auml;lt
gel&ouml;ste Beispiele, sowie Aufgaben f&uuml;r den Leser.
<p>Das Buch ist in folgende 8 Teile gegliedert:
<p><b>Teil I: The Elements</b>
<br>Diser Teil fa&szlig;t elementare Konzepte f&uuml;r Systeme und Signale
zusammen. Er w&uuml;rde sich entweder f&uuml;r einen einf&uuml;hrenden
Kurs eignen, oder als Wiederholung am Anfang eines weiterf&uuml;hrenden
Kurses.
<p><b>Teil II: SISO Control Essentials</b>
<br>Dieser Teil enth&auml;lt die Grundlagen von Single-Input-Single-Output
Regelung, einschlie&szlig;lich klassischer PID Regelung. Zusammen beinhalten
Teil I und II die Themen typischer Einf&uuml;hrungskurse.
<p><b>Teil III: SISO Control Design</b>
<br>Dieser Teil behandelt Design, also das Erkennen und den Umgang mit
Begrenzungen und Zielkonflikten. Dieses geh&ouml;rt unserer Meinung nach
zum Kernmaterial und sollte Studenten m&ouml;glichst fr&uuml;h nahe gebracht
werden. Das Thema von Begrenzungen in der Aktorik, aber auch Feedforward
und Kaskaden, sind besonders wichtig f&uuml;r Anwendungen.
<p><b>Teil IV: Digital Computer Control</b>
<br>Dieser Teil besch&auml;ftigt sich mit digitaler Regelung. Zus&auml;tzlich
zum klassischen Material behandelt er auch das f&uuml;r Anwendungen wichtige
Verhalten zwischen den digitalen Messungen (intersample Verhalten).
<p><b>Teil V: Advanced SISO Control</b>
<br>Dieses Material k&ouml;nnte die Basis eines weiterf&uuml;hrenden Kurses
bilden. Er behandelt Methoden, die sich auch f&uuml;r die Verallgemeinerung
auf Systeme mit mehreren Gr&ouml;&szlig;en (MIMO) eignen.
<p><b>Teil VI: MIMO Control Essentials</b>
<br>Dieser Teil behandelt die Grundlagen f&uuml;r MIMO Systeme. Er eignet
sich als Einf&uuml;hrung in einen ersten Kurs f&uuml;r multivariable Systeme.
<p><b>Teil VII: MIMO Control Design</b>
<br>Dieser Teil enth&auml;lt Ans&auml;tze und Techniken f&uuml;r industrielle
MIMO Regelungen. Er behandelt LQ Methoden zum regeln und filtern, sowie
Model Predictive Control (MPC).
<p><b>Teil VIII: Advanced MIMO Control</b>
<br>Der letzte Teil des Buches kann entweder f&uuml;r Einzelstudium und
Forschung genutzt werden, oder den Abschlu&szlig; eines weiterf&uuml;hrenden
MIMO Kurses (bestehend aus Teilen V oder VI bis VIII) bilden.
<p>Zwei der Autoren (Goodwin und Salgado) haben Kurse von Manuskriptversionen
des Buches in Australien und S&uuml;damerika gelehrt.
<p>Das Buch enth&auml;lt zahlreiche Fallbeispiele. Sie stammen aus industriellen
Projekten, die von den Autoren in Zusammenarbeit mit den beauftragenden
Industrien am Centre for Integrated Dynamics and Control (CIDAC) an der
University of Newcastle, Australien, durchgef&uuml;hrt wurden:
<ul>
<li>
Antennenrichten f&uuml;r Satelliten</li>

<li>
pH-Wert Regelung</li>

<li>
Stranggie&szlig;en in der Stahlindustrie</li>

<li>
Regelung von Zuckerrohrm&uuml;hlen</li>

<li>
Destillation</li>

<li>
Ammoniak Synthese Prozess</li>

<li>
Zinkbeschichtung</li>

<li>
Diverse Regelungen in Walzwerken</li>

<li>
Vibrationsregelung.</li>
</ul>
Die meisten dieser Applikationen sind auch auf der Webseite des Buches
als Java Applets implementiert. Wir ermutigen Leser, in diesem sehr anschaulichem
virtuellen Labor zu experimentieren. Neben der intuitiven Visualisierung
und Animation, bietet die Webseite auch den Vorteil, alle Applikationen
im Zusammenhang sehen zu k&ouml;nnen.
<p>Zus&auml;tzlich zu den industriellen Fallbeispielen, enthalten sowohl
Buch als auch Webseite einige Laborapplikationen, wie zum Beispiel das
ber&uuml;hmte invertierte Pendel, gekoppelte Tanks und der auf einer Platte
balancierte Ball.
<p>Webunterst&uuml;tzung wurde von Hrn. Nathan Clement implementiert und
befindet sich unter
<p>http://csd.newcastle.edu.au/control/
<p>oder unter einem Link auf den Homepages der Autoren.
<div align=right>
<p>Newcastle, Australien
<br>Valparaiso, Chile
<br>Wien, &Ouml;sterreich</div>

<p><br>
<p><!------------------------------------------------>&nbsp;
<center><table BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH="500" >
<tr>
<td ALIGN=CENTER WIDTH="33%"><img SRC="backbutton.gif" ALT="<-" BORDER=0 height=32 width=32>
<br>Previous</td>

<td ALIGN=CENTER WIDTH="33%"><a href="book.html"><img SRC="upbutton.gif" ALT="^" BORDER=0 height=32 width=32></a>
<br><a href="book.html">Up - Book Contents</a></td>

<td ALIGN=CENTER WIDTH="33%"><img SRC="nextbutton.gif" BORDER=0 height=32 width=32>
<br>Next</td>
</tr>
</table></center>
</td>
</tr>
</table></center>

</body>
</html>
